In [3]:
import sqlite3
conn=sqlite3.connect("AnyDatabase.db")
print("Opened Database Successfully")

Opened Database Successfully

In [4]:
conn.execute("CREATE TABLE Employees(ID INT PRIMARY KEY, NAME TEXT,AGE INT, ADDRESS TEXT,SALARY REAL)")

In [6]:
conn.execute("insert into Employees(ID,NAME,AGE,ADDRESS,SALARY) VALUES(1,'Ajeet',27,'Delhi',20000.00)")

In [8]:
conn.execute("insert into Employees(ID,NAME,AGE,ADDRESS,SALARY) VALUES(2,'Allen',22,'London',25000.00)")

In [9]:
conn.execute("insert into Employees(ID,NAME,AGE,ADDRESS,SALARY) VALUES(3,'Mark',29,'CA',200000.00)")

In [10]:
conn.execute("insert into Employees(ID,NAME,AGE,ADDRESS,SALARY) VALUES(4,'Kanchan',22,'Ghaziabad',65000.00)")

In [11]:
conn.commit()

In [ ]:
#Dispalying contents

In [12]:
results=conn.execute("SELECT * FROM Employees")
for i in results:
    print(i)

(1, 'Ajeet', 27, 'Delhi', 20000.0)
(2, 'Allen', 22, 'London', 25000.0)
(3, 'Mark', 29, 'CA', 200000.0)
(4, 'Kanchan', 22, 'Ghaziabad', 65000.0)

In [13]:
results=conn.execute("SELECT ID,NAME FROM Employees")
for i in results:
    print(i)

(1, 'Ajeet')
(2, 'Allen')
(3, 'Mark')
(4, 'Kanchan')

In [14]:
results=conn.execute("SELECT NAME,AGE,ADDRESS FROM Employees")
for i in results:
    print(i)

('Ajeet', 27, 'Delhi')
('Allen', 22, 'London')
('Mark', 29, 'CA')
('Kanchan', 22, 'Ghaziabad')

In [19]:
results=conn.execute("SELECT * FROM Employees WHERE NAME='Mark'")
for i in results:
    print(i)

(3, 'Mark', 29, 'CA', 200000.0)

In [20]:
results=conn.execute("SELECT * FROM Employees WHERE address='London'")
for i in results:
    print(i)

(2, 'Allen', 22, 'London', 25000.0)

In [21]:
results=conn.execute("SELECT NAME,AGE FROM Employees WHERE NAME='Mark'")
for i in results:
    print(i)

('Mark', 29)

In [22]:
results=conn.execute("SELECT * FROM Employees WHERE NAME in('Mark','Allen')")
for i in results:
    print(i)

(2, 'Allen', 22, 'London', 25000.0)
(3, 'Mark', 29, 'CA', 200000.0)

In [25]:
results=conn.execute("SELECT * FROM Employees order by NAME ASC")
for i in results:
    print(i)

(1, 'Ajeet', 27, 'Delhi', 20000.0)
(2, 'Allen', 22, 'London', 25000.0)
(4, 'Kanchan', 22, 'Ghaziabad', 65000.0)
(3, 'Mark', 29, 'CA', 200000.0)

In [27]:
results=conn.execute("SELECT * FROM Employees ORDER BY SALARY DESC")
for i in results:
    print(i)

(3, 'Mark', 29, 'CA', 200000.0)
(4, 'Kanchan', 22, 'Ghaziabad', 65000.0)
(2, 'Allen', 22, 'London', 25000.0)
(1, 'Ajeet', 27, 'Delhi', 20000.0)

In [29]:
results=conn.execute("SELECT * FROM Employees LIMIT 3")
for i in results:
    print(i)

(1, 'Ajeet', 27, 'Delhi', 20000.0)
(2, 'Allen', 22, 'London', 25000.0)
(3, 'Mark', 29, 'CA', 200000.0)

In [30]:
results=conn.execute("SELECT * FROM Employees WHERE SALARY>20000 AND SALARY<=65000")
for i in results:
    print(i)

(2, 'Allen', 22, 'London', 25000.0)
(4, 'Kanchan', 22, 'Ghaziabad', 65000.0)

In [31]:
results=conn.execute("SELECT * FROM Employees WHERE ID=1 AND NAME='Allen'")
for i in results:
    print(i)

In [33]:
results=conn.execute("SELECT * FROM Employees WHERE SALARY IS NOT NULL")
for i in results:
    print(i)

(1, 'Ajeet', 27, 'Delhi', 20000.0)
(2, 'Allen', 22, 'London', 25000.0)
(3, 'Mark', 29, 'CA', 200000.0)
(4, 'Kanchan', 22, 'Ghaziabad', 65000.0)

In [34]:
results=conn.execute("SELECT * FROM Employees WHERE ID=1 OR NAME='Allen'")
for i in results:
    print(i)

(1, 'Ajeet', 27, 'Delhi', 20000.0)
(2, 'Allen', 22, 'London', 25000.0)

In [35]:
results=conn.execute("SELECT MIN(SALARY) FROM Employees")
results.fetchone()

(20000.0,)

In [36]:
results=conn.execute("SELECT MAX(SALARY) FROM Employees")
results.fetchone()

(200000.0,)

In [37]:
results=conn.execute("SELECT AVG(SALARY) FROM Employees")
results.fetchone()

(77500.0,)

In [38]:
results=conn.execute("SELECT SUM(SALARY) FROM Employees")
results.fetchone()

(310000.0,)

In [43]:
results=conn.execute("SELECT * FROM Employees WHERE SALARY BETWEEN 20000 AND 25000")
for i in results:
    print(i)

(1, 'Ajeet', 27, 'Delhi', 20000.0)
(2, 'Allen', 22, 'London', 25000.0)

In [45]:
results=conn.execute("SELECT * FROM Employees WHERE ID BETWEEN 1 AND 3")
for i in results:
    print(i)

(1, 'Ajeet', 27, 'Delhi', 20000.0)
(2, 'Allen', 22, 'London', 25000.0)
(3, 'Mark', 29, 'CA', 200000.0)

In [49]:
results=conn.execute("SELECT * FROM Employees WHERE NAME LIKE 'A%'")
for i in results:
    print(i)

(1, 'Ajeet', 27, 'Delhi', 20000.0)
(2, 'Allen', 22, 'London', 25000.0)

In [50]:
results=conn.execute("SELECT * FROM Employees WHERE ADDRESS LIKE '%on%'")
for i in results:
    print(i)

(2, 'Allen', 22, 'London', 25000.0)

In [51]:
results=conn.execute("SELECT * FROM Employees WHERE NAME LIKE 'M%'")
for i in results:
    print(i)

(3, 'Mark', 29, 'CA', 200000.0)

In [53]:
results=conn.execute("SELECT * FROM Employees WHERE NAME LIKE '__l%'")
for i in results:
    print(i)

(2, 'Allen', 22, 'London', 25000.0)

In [54]:
results=conn.execute("SELECT * FROM Employees WHERE NAME LIKE '%n'")
for i in results:
    print(i)

(2, 'Allen', 22, 'London', 25000.0)
(4, 'Kanchan', 22, 'Ghaziabad', 65000.0)

In [55]:
results=conn.execute("SELECT * FROM Employees WHERE NAME LIKE '%'")
for i in results:
    print(i)

(1, 'Ajeet', 27, 'Delhi', 20000.0)
(2, 'Allen', 22, 'London', 25000.0)
(3, 'Mark', 29, 'CA', 200000.0)
(4, 'Kanchan', 22, 'Ghaziabad', 65000.0)

In [57]:
results=conn.execute("SELECT * FROM Employees WHERE NAME LIKE '____'")
for i in results:
    print(i)

(3, 'Mark', 29, 'CA', 200000.0)

In [58]:
results=conn.execute("SELECT * FROM Employees WHERE NAME NOT IN('Allen')")
for i in results:
    print(i)

(1, 'Ajeet', 27, 'Delhi', 20000.0)
(3, 'Mark', 29, 'CA', 200000.0)
(4, 'Kanchan', 22, 'Ghaziabad', 65000.0)

In [ ]:
#Update the entries

In [60]:
sql="UPDATE Employees SET SALARY=30000 WHERE NAME='Ajeet'"
conn.execute(sql)
results=conn.execute("SELECT * FROM Employees")
for i in results:
    print(i)

(1, 'Ajeet', 27, 'Delhi', 30000.0)
(2, 'Allen', 22, 'London', 25000.0)
(3, 'Mark', 29, 'CA', 200000.0)
(4, 'Kanchan', 22, 'Ghaziabad', 65000.0)

In [ ]:
#deleting records

In [62]:
sql="delete from Employees where id='2'"
conn.execute(sql)
results=conn.execute("SELECT * FROM Employees")
for i in results:
    print(i)

(1, 'Ajeet', 27, 'Delhi', 30000.0)
(3, 'Mark', 29, 'CA', 200000.0)
(4, 'Kanchan', 22, 'Ghaziabad', 65000.0)